// 制作者日記のデータ（上にあるものほど新しい記事として表示されます）
const DIARY_DATA = [
    {
        date: "2026年7月8日",
        title: "名前の登録が追加されました",
        content: "名前の登録が追加されました。あと、記録が残るようになりました。なお、この名前と記録は外部に公開されることはないので、ご安心ください。"
    },
　　{
        date: "2026年7月7日",
        title: "チャレンジモードが追加されました",
        content: "京都はどうやら、梅雨明けしたっぽいです。しばらくは、暑すぎて神社行けなくなるのが寂しい。夏の京都はもはや、アネクメーネの域だから。暇なので、チャレンジモード作ってみました。"
    },
    {
        date: "2026年7月5日",
        title: "「山王神社」、「松原稲荷神社」がハードモードに追加されました",
        content: "一昨日、久しぶりに神社巡りをしました。西院近辺をぶらり。路面電車とか走ってて、町の雰囲気よかった。でも、普通に暑くてしんどかった。今回、参拝した「山王（さんのう）神社」、「松原（まつばら）稲荷神社」がハードモードに追加されてます。"
    },
    {
        date: "2026年7月5日",
        title: "Shrinedle 制作者日記ページを開設しました",
        content: "私が新しく巡った神社の情報、アップデート情報、その他諸々を発信していく予定です。ロゴを押したらこのページに飛ぶのは、ただの遊び心です。"
    }
];